Linna_Liu/week10homework/monday/ba-rails-backend/app/controllers/flights_controller.rb

  def search
    puts "origin: #{params[:origin]}"
    puts "destination: #{params[:destination]}"

    #use where instead of find_by for multiple results search
    results = Flight.where origin: params[:origin], destination: params[:destination]
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "SYD"], ["destination", "SFO"]]

  def show
    result = Flight.find params[:id];
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 25], ["LIMIT", 1]]

  def reservation
      reservation = Reservation.create row: params['row'], col: params['col'], user_id: 29, flight_id: params[:id]
---
INSERT INTO "reservations" ("user_id", "flight_id", "row", "col", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 29], ["flight_id", 25], ["row", 1], ["col", 1], ["created_at", "2018-06-18 11:23:58.747788"], ["updated_at", "2018-06-18 11:23:58.747788"]]