Hoang_Anh_Tran/week10/mon-burning-airlines-rails-vue/ba-rails-backend/app/controllers/flights_controller.rb

  def search
    puts "origin: #{params[:origin]}"
    puts "origin: #{params[:destination]}"

    results = Flight.where origin: params[:origin], destination: params[:destination]
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "SYD"], ["destination", "JFK"]]

  def show
    flight = Flight.find params[:id]
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]