Hoang_Anh_Tran/week10/mon-burning-airlines-rails-vue/ba-rails-backend/app/controllers/reservations_controller.rb

SELECT  "flights".* FROM "flights" WHERE "flights"."flight_number" = $1 LIMIT $2  [["flight_number", 256], ["LIMIT", 1]]
INSERT INTO "reservations" ("user_id", "flight_id", "row", "col", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 10], ["flight_id", 10], ["row", 1], ["col", 1], ["created_at", "2018-06-18 12:16:08.535214"], ["updated_at", "2018-06-18 12:16:08.535214"]]
SELECT  "reservations".* FROM "reservations" ORDER BY "reservations"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def create
    newres = Reservation.new reservation_params
    newres.flight = Flight.find_by flight_number: params[:flightnum]
    newres.passenger = fake_passenger
    newres.row = params[:row]
    newres.col = params[:col]
    newres.save
    return Reservation.last

SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def fake_passenger
    User.first