Hoang_Anh_Tran/week5/wednesday/designer-app/app/views/countries/show.html.erb

<ul>
  <% @country.brands.each do |brand| %>
---
SELECT "brands".* FROM "brands" WHERE "brands"."country_id" = ?  [["country_id", 4]]