Hoang_Anh_Tran/week5/wednesday/designer-app/app/controllers/brands_controller.rb

  def create
    Brand.create brand_params
---
INSERT INTO "brands" ("name", "origin", "founded", "image", "created_at", "updated_at", "country_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "Bearbro"], ["origin", "Australia"], ["founded", "by bear"], ["image", ""], ["created_at", "2018-05-16 11:55:19.578041"], ["updated_at", "2018-05-16 11:55:19.578041"], ["country_id", 5]]

  def show
    @brand = Brand.find params[:id]
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def edit
    @brand = Brand.find params[:id]
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def update
    brand = Brand.find params[:id]
    brand.update brand_params
---
SELECT  "brands".* FROM "brands" WHERE "brands"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "brands" SET "founded" = ?, "updated_at" = ? WHERE "brands"."id" = ?  [["founded", "by bear is awesome"], ["updated_at", "2018-05-16 11:55:31.000573"], ["id", 11]]

  def destroy
    Brand.destroy params[:id]
---
DELETE FROM "brands" WHERE "brands"."id" = ?  [["id", 12]]