Hoang_Anh_Tran/week5/wednesday/designer-app/app/controllers/countries_controller.rb

INSERT INTO "countries" ("name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Space"], ["image", "http://earthzine.org/wp-content/uploads/2009/02/IMG_4359.jpg"], ["created_at", "2018-05-16 11:54:03.472964"], ["updated_at", "2018-05-16 11:54:03.472964"]]
---
  def create
    country = Country.create country_params

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @country = Country.find params[:id]

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def edit
      @country = Country.find params[:id]

SELECT  "countries".* FROM "countries" WHERE "countries"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "countries" SET "name" = ?, "updated_at" = ? WHERE "countries"."id" = ?  [["name", "Space2"], ["updated_at", "2018-05-16 11:54:11.403014"], ["id", 7]]
---
    def update
      country = Country.find params[:id]
      country.update country_params

      if country.errors.any?

DELETE FROM "countries" WHERE "countries"."id" = ?  [["id", 7]]
---
  def destroy
  Country.destroy params[:id] #artist = Artist.find params[:id]