Linna_Liu/week05homework/tuesday/serial-killers/app/controllers/killers_controller.rb

  def create
    Killer.create(
      name: params[:name],
      image: params[:image],
      country: params[:country],
      years_active_from: params[:years_active_from],
      years_active_to: params[:years_active_to],
      proven_victims: params[:proven_victims],
      notes: params[:notes]
    )
---
INSERT INTO "killers" ("name", "image", "country", "years_active_from", "years_active_to", "proven_victims", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @killers = Killer.all
---
SELECT "killers".* FROM "killers"

  def details
    @killer = Killer.find params[:id]
    @all_ids = Killer.all.ids
---
SELECT  "killers".* FROM "killers" WHERE "killers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "killers"."id" FROM "killers"

  def edit
    @killer = Killer.find params[:id]
---
SELECT  "killers".* FROM "killers" WHERE "killers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    killer = Killer.find params[:id]
    killer.update(
      name: params[:name],
      image: params[:image],
      country: params[:country],
      years_active_from: params[:years_active_from],
      years_active_to: params[:years_active_to],
      proven_victims: params[:proven_victims],
      notes: params[:notes]
    )
---
SELECT  "killers".* FROM "killers" WHERE "killers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "killers" SET "image" = ?, "updated_at" = ? WHERE "killers"."id" = ?  [["image", "https://marcianosmx.com/wp-content/uploads/2018/01/evolucion-de-luis-alfredo-garavito.jpg"], ["updated_at", "2018-05-15 14:06:34.880443"], ["id", 1]]

  def delete
    killer = Killer.find params[:id]
    killer.destroy
---
SELECT  "killers".* FROM "killers" WHERE "killers"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "killers" WHERE "killers"."id" = ?  [["id", 10]]