Brendan_Leonard/week05/wednesday/beers/app/views/beers/_form.html.erb

    <div class="input-field">
      <%= f.select :brewery_id, Brewery.pluck(:name, :id), include_blank: true %>
---
SELECT "breweries"."name", "breweries"."id" FROM "breweries"