Brendan_Leonard/week05/wednesday/beers/app/views/beers/index.html.erb

SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]
---
  <h3><%= link_to brewery.name, brewery_path( brewery ) %>, <%= brewery.region %></h3>
    <% brewery.beers.each do |beer| %>