Bhagavathi_Chirra/week5/employees-db/app/controllers/employees_controller.rb

  def show
    @employee = Employee.find params[:id]
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    Employee.create(
      number: params[:number],
      first_name: params[:first_name],
      last_name: params[:last_name],
      job_title: params[:job_title],
      date_of_birth: params[:date_of_birth],
      image: params[:image],
      salary: params[:salary]
    )
---
INSERT INTO "employees" ("number", "first_name", "last_name", "job_title", "date_of_birth", "image", "salary", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @employee = Employee.find params[:id]
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    employee = Employee.find params[:id]
    employee.update(
      number: params[:number],
      first_name: params[:first_name],
      last_name: params[:last_name],
      job_title: params[:job_title],
      date_of_birth: params[:date_of_birth],
      image: params[:image],
      salary: params[:salary]
    )
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "employees" SET "first_name" = ?, "last_name" = ?, "job_title" = ?, "salary" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["first_name", "Bagi"], ["last_name", "Chirra"], ["job_title", "Receptionist"], ["salary", 3000], ["updated_at", "2018-05-15 11:10:13.493833"], ["id", 3]]

  def delete
    employee = Employee.find params[:id]
    employee.destroy
---
SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 6]]