Hoang_Anh_Tran/week5/wednesday/designer-app/app/views/brands/_form.html.erb

SELECT "countries"."name", "countries"."id" FROM "countries"
---
  <%= f.label :country_id, 'Country' %>
  <%= f.select :country_id, Country.pluck(:name, :id), include_blank: true %>