Brendan_Leonard/week05/tuesday/cheese-rails/app/controllers/cheeses_controller.rb

  def create
    Cheese.create(
      name: params[:name],
      varietal: params[:varietal],
      description: params[:description],
      firmness: params[:firmness],
      region: params[:region],
      milk: params[:milk],
      size: params[:size],
      unit_of_measure: params[:unit_of_measure],
      price: params[:price],
      image: params[:image]
    )
---
INSERT INTO "cheeses" ("name", "description", "firmness", "region", "milk", "size", "unit_of_measure", "price", "image", "created_at", "updated_at", "varietal") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def index
    @cheeses = Cheese.all
---
SELECT "cheeses".* FROM "cheeses"

  def show
    @cheese = Cheese.find params[:id]
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def edit
    @cheese = Cheese.find params[:id]
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def update
    cheese = Cheese.find params[:id]

    cheese.update(
      name: params[:name],
      varietal: params[:varietal],
      description: params[:description],
      firmness: params[:firmness],
      region: params[:region],
      milk: params[:milk],
      size: params[:size],
      unit_of_measure: params[:unit_of_measure],
      price: params[:price],
      image: params[:image]
    )
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "cheeses" SET "firmness" = ?, "milk" = ?, "updated_at" = ? WHERE "cheeses"."id" = ?  [["firmness", "Fresh"], ["milk", "Cows"], ["updated_at", "2018-05-15 23:06:16.375209"], ["id", 9]]

  def delete
    cheese = Cheese.find params[:id]
    cheese.delete
---
SELECT  "cheeses".* FROM "cheeses" WHERE "cheeses"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
DELETE FROM "cheeses" WHERE "cheeses"."id" = ?  [["id", 10]]