Scott_Lee/week05homework/murderers/app/controllers/murderers_controller.rb

    def create

        Murderer.create(
            first_name: params[:first_name],
            last_name: params[:last_name],
            age: params[:age],
            location: params[:location],
            victim_type: params[:victim_type],
            kill_method: params[:kill_method],
            kill_count: params[:kill_count],
            fate: params[:fate]
            )
---
INSERT INTO "murderers" ("first_name", "last_name", "age", "location", "victim_type", "kill_method", "kill_count", "fate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def index
        @murderers = Murderer.all
---
SELECT "murderers".* FROM "murderers"

    def show
        @murderer = Murderer.find(params[:id])
---
SELECT  "murderers".* FROM "murderers" WHERE "murderers"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    def edit
        @murderer = Murderer.find(params[:id])
---
SELECT  "murderers".* FROM "murderers" WHERE "murderers"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

    def update
        murderer = Murderer.find(params[:id])

        murderer.update(
            first_name: params[:first_name],
            last_name: params[:last_name],
            age: params[:age],
            location: params[:location],
            victim_type: params[:victim_type],
            kill_method: params[:kill_method],
            kill_count: params[:kill_count],
            fate: params[:fate]
            )
---
SELECT  "murderers".* FROM "murderers" WHERE "murderers"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "murderers" SET "fate" = ?, "updated_at" = ? WHERE "murderers"."id" = ?  [["fate", "jkjkjsdsd"], ["updated_at", "2018-05-15 14:11:40.769092"], ["id", 12]]

    def destroy
        murderer = Murderer.find(params[:id])
        murderer.destroy
---
SELECT  "murderers".* FROM "murderers" WHERE "murderers"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "murderers" WHERE "murderers"."id" = ?  [["id", 12]]