Linna_Liu/week05homework/wednesday/royal-residences/app/controllers/royals_controller.rb

  def index
    @royals = Royal.all
---
SELECT "royals".* FROM "royals"