Anastasia_Gorodinskaya/week05/boxcats-db/app/controllers/boxcats_controller.rb

def create

  Boxcat.create(
    name: params[:name],
    image: params[:image],
    box_volume: params[:box_volume],
    cat_size: params[:cat_size],
    cat_origin: params[:cat_origin],

  )
---
INSERT INTO "boxcats" ("name", "image", "box_volume", "cat_size", "cat_origin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

def index
  @boxcats = Boxcat.all
---
SELECT "boxcats".* FROM "boxcats"

def show
  @boxcat = Boxcat.find params[:id]
---
SELECT  "boxcats".* FROM "boxcats" WHERE "boxcats"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

def edit
  @boxcat = Boxcat.find params[:id]
---
SELECT  "boxcats".* FROM "boxcats" WHERE "boxcats"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

def update
  boxcat = Boxcat.find params[:id]
  boxcat.update(
    name: params[:name],
    image: params[:image],
    box_volume: params[:box_volume],
    cat_size: params[:cat_size],
    cat_origin: params[:cat_origin],
  )
---
SELECT  "boxcats".* FROM "boxcats" WHERE "boxcats"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "boxcats" SET "name" = ?, "updated_at" = ? WHERE "boxcats"."id" = ?  [["name", "Cat"], ["updated_at", "2018-05-16 00:14:12.714507"], ["id", 12]]

def destroy
  boxcat = Boxcat.find params[:id]
  boxcat.destroy
---
SELECT  "boxcats".* FROM "boxcats" WHERE "boxcats"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "boxcats" WHERE "boxcats"."id" = ?  [["id", 9]]