Brendan_Leonard/week05/wednesday/beers/app/controllers/beers_controller.rb

  def create
    beer = Beer.create beer_params
---
INSERT INTO "beers" ("name", "style", "description", "size", "abv", "std_drinks", "image", "brewery_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def show
    @beer = Beer.find params[:id]
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]

  def edit
    @beer = Beer.find params[:id]
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]

  def update
    beer = Beer.find params[:id]
    beer.update beer_params

    if beer.errors.any?
---
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
UPDATE "beers" SET "style" = ?, "updated_at" = ? WHERE "beers"."id" = ?  [["style", "Golden Ale Yum"], ["updated_at", "2018-05-16 23:06:53.663133"], ["id", 26]]
SELECT  "beers".* FROM "beers" WHERE "beers"."id" = ? LIMIT ?  [["id", 27], ["LIMIT", 1]]

  def destroy
    Beer.destroy params[:id]
---
DELETE FROM "beers" WHERE "beers"."id" = ?  [["id", 29]]