Brendan_Leonard/week05/wednesday/beers/app/controllers/breweries_controller.rb

  def create
    brewery = Brewery.create brewery_params
---
INSERT INTO "breweries" ("name", "country", "region", "founded", "logo_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def show
    @brewery = Brewery.find params[:id]
---
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]

  def edit
    @brewery = Brewery.find params[:id]
---
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def update
    brewery = Brewery.find params[:id]
    brewery.update brewery_params

    if brewery.errors.any?
---
SELECT  "breweries".* FROM "breweries" WHERE "breweries"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def destroy
    Brewery.destroy params[:id]
---
DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 7]]