Hoang_Anh_Tran/week10/tue/burning-airlines-rails-vue/ba-rails-backend/app/controllers/flights_controller.rb

  def search
    puts "origin: #{params[:origin]}"
    puts "origin: #{params[:destination]}"

    results = Flight.where origin: params[:origin], destination: params[:destination]
---
SELECT "flights".* FROM "flights" WHERE "flights"."origin" = $1 AND "flights"."destination" = $2  [["origin", "SYD"], ["destination", "SFO"]]

  def show

    p current_user # return user login with token # Knock provides the @current_user method
    # to return to us the user (if any) that was successfully authenticated via the '/user_token' route

    flight = Flight.find params[:id]
---
SELECT  "flights".* FROM "flights" WHERE "flights"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]