Brendan_Leonard/week05/wednesday/beers/app/views/breweries/show.html.erb

      <ul>
      <% @brewery.beers.each do |beer| %>
---
SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 1]]