Hoang_Anh_Tran/week5/tues/serial-killers-db/app/controllers/serialkillers_controller.rb

  def create
    Serialkiller.create(
      first_name: params[:first_name],
      last_name: params[:last_name],
      image: params[:image],
      alive: params[:alive],
      victims: params[:victims]
    )
---
INSERT INTO "serialkillers" ("first_name", "last_name", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["first_name", "coding"], ["last_name", "totoro"], ["image", ""], ["created_at", "2018-05-15 12:01:21.371416"], ["updated_at", "2018-05-15 12:01:21.371416"]]

  def index
    @serialkillers = Serialkiller.all
---
SELECT "serialkillers".* FROM "serialkillers"

  def show
    @serialkiller = Serialkiller.find params[:id]
---
SELECT  "serialkillers".* FROM "serialkillers" WHERE "serialkillers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @serialkiller = Serialkiller.find params[:id]
---
SELECT  "serialkillers".* FROM "serialkillers" WHERE "serialkillers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    serialkiller = Serialkiller.find params[:id]
    serialkiller.update(
      first_name: params[:first_name],
      last_name: params[:last_name],
      image: params[:image],
      alive: params[:alive],
      victims: params[:victims]
    )
---
SELECT  "serialkillers".* FROM "serialkillers" WHERE "serialkillers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "serialkillers" SET "image" = ?, "updated_at" = ? WHERE "serialkillers"."id" = ?  [["image", "https://www.biography.com/.image/t_share/MTQ1NDY3ODU4MjI5NDA1MjM5/ted-bundy---to-sleep-with-danger.jpg"], ["updated_at", "2018-05-15 12:22:30.274202"], ["id", 1]]

  def destroy
    serialkiller = Serialkiller.find params[:id]
    serialkiller.destroy
---
SELECT  "serialkillers".* FROM "serialkillers" WHERE "serialkillers"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "serialkillers" WHERE "serialkillers"."id" = ?  [["id", 6]]